* Solidity common vulnerabilities

This repository contains a [[./results/bugs.csv][dataset]] of high vulnerabilities registered on [[https://code4rena.com/][Code 4 Arena]] and [[https://www.sherlock.xyz/][Sherlock]] between January 2023 to September 2023. The dataset is composed of 100 vulnerabilities (more will be added) which were manually classified into the categories described [[./categories.org][here]]

** Contests

The contests analyzed were the following:
#+tblname: contests
| PLATFORM  | CATEGORY          | CONTEST                                   |  BOUNTY | HRF |  nSLOC | PARTICIPANTS |    DATE |
|-----------+-------------------+-------------------------------------------+---------+-----+--------+--------------+---------|
| Code4rena | DAO               | [[https://code4rena.com/reports/2023-08-arbitrum][Arbitrum security council election system]] |   90500 |   1 |   2184 |           39 | 2023-09 |
| Code4rena | DAO               | [[https://code4rena.com/reports/2023-06-llama][Llama]]                                     |   60500 |   2 |   2096 |           50 | 2023-07 |
| Code4rena | CDP               | [[https://code4rena.com/reports/2023-06-lybra][Lybra finance]]                             |   60500 |   8 |   1762 |          136 | 2023-08 |
| Code4rena | Dexes             | [[https://code4rena.com/reports/2023-05-maia][Maia DAO ecosystem]]                        |  300500 |  35 |  10997 |           85 | 2023-05 |
| Code4rena | Yield             | [[https://code4rena.com/reports/2023-07-pooltogether#wardens][PoolTogether]]                              |  121650 |   9 |   3324 |          117 | 2023-07 |
| Code4rena | Yield             | [[https://code4rena.com/reports/2023-08-pooltogether][PoolTogether v5: part deux]]                |   42000 |   2 |   1001 |           45 | 2023-08 |
| Sherlock  | Lending           | [[https://audits.sherlock.xyz/contests/75][Ajna update]]                               |   85600 |   6 |   5659 |          155 | 2023-06 |
| Sherlock  | Yield Agreggator  | [[https://audits.sherlock.xyz/contests/41][Blueberry]]                                 |   72500 |  10 |        |          284 | 2023-02 |
| Sherlock  | Yield Agreggator  | [[https://audits.sherlock.xyz/contests/104/report][Blueberry Update #3]]                       |   23600 |   5 |   3633 |          183 | 2023-08 |
| Sherlock  | Options           | [[https://audits.sherlock.xyz/contests/99][Bond options]]                              |   23600 |   2 |    885 |          153 | 2023-07 |
| Sherlock  | Lending           | [[https://audits.sherlock.xyz/contests/107][Cooler update]]                             |   17000 |   4 |    512 |          170 | 2023-08 |
| Sherlock  | Dexes             | [[https://audits.sherlock.xyz/contests/97][GFX labs]]                                  |   20400 |   2 |    716 |          106 | 2023-07 |
| Sherlock  | Derivatives       | [[https://audits.sherlock.xyz/contests/74][GMX]]                                       |  200000 |   5 |  10571 |          220 | 2023-04 |
| Sherlock  | Lending           | [[https://audits.sherlock.xyz/contests/84][Iron bank]]                                 |   67400 |   1 |   2241 |          271 | 2023-05 |
| Sherlock  | Derivatives       | [[https://audits.sherlock.xyz/contests/79][Perennial]]                                 |  122000 |   1 |   4063 |          220 | 2023-05 |
| Sherlock  | Derivatives       | [[https://audits.sherlock.xyz/contests/106][Perennial v2]]                              |  125200 |   6 |   2494 |          252 | 2023-07 |
| Sherlock  | Derivatives       | [[https://audits.sherlock.xyz/contests/85][Symmetrical]]                               |   91000 |   8 |   3553 |          233 | 2023-06 |
| Sherlock  | Derivatives       | [[https://audits.sherlock.xyz/contests/108][Symmetrical Update]]                        |   27600 |   2 |   3921 |           52 | 2023-08 |
| Sherlock  | Launchpad         | [[https://audits.sherlock.xyz/contests/100][Tokensoft]]                                 |   21400 |   1 |    769 |          221 | 2023-07 |
| Sherlock  | Stablecoin        | [[https://audits.sherlock.xyz/contests/73][Unitas protocol]]                           |   36400 |   1 |   1433 |          208 | 2023-06 |
| Code4rena | RWA               | [[https://code4rena.com/contests/2023-01-ondo-finance-contest][Ondo finance]]                              |   60500 |   1 |   4365 |           74 | 2023-01 |
| Sherlock  | Indexes           | [[https://audits.sherlock.xyz/contests/81][Index coop]]                                |  130600 |   2 |   4383 |          283 | 2023-05 |
| Sherlock  | Stablecoin        | [[https://audits.sherlock.xyz/contests/82][USSD]]                                      |   18200 |   3 |    402 |          224 | 2023-05 |
| Sherlock  | RWA               | [[https://audits.sherlock.xyz/contests/98][Dinari]]                                    |   16000 |   1 |    575 |          176 | 2023-07 |
| Sherlock  | Dexes             | [[https://audits.sherlock.xyz/contests/88][RealWagmi]]                                 |   33200 |   5 |   1080 |          203 | 2023-06 |
| Code4rena | DAO               | [[https://code4rena.com/reports/2023-07-nounsdao][Nouns DAO]]                                 |  100000 |   1 |   9098 |           36 | 2023-07 |
| Sherlock  | Dexes             | [[https://audits.sherlock.xyz/contests/89][DODO v3]]                                   |   57800 |   5 |   2079 |          151 | 2023-06 |
| Sherlock  | Derivatives       | [[https://audits.sherlock.xyz/contests/72][Hubble Exchange]]                           |   60000 |   3 |   1945 |          148 | 2023-06 |
| Code4rena | Stablecoin        | [[https://code4rena.com/contests/2023-06-angle-protocol-invitational][Angle Protocol]]                            |   52500 |   3 |   2276 |            5 | 2023-07 |
| Code4rena | Liquidity manager | [[https://audits.sherlock.xyz/contests/86][Arrakis]]                                   |   81400 |   2 |   2801 |          247 | 2023-06 |
| Sherlock  | Dexes             | [[https://audits.sherlock.xyz/contests/95][Unstoppable]]                               |   36400 |   8 |   2035 |          130 | 2023-06 |
|-----------+-------------------+-------------------------------------------+---------+-----+--------+--------------+---------|
| TOTALS    |                   |                                           | 2255950 | 145 | 3095.1 |    157.32258 |         |
#+tblfm: @33$4=vsum(@2$4..@-1$4)::@33$5=vsum(@2$5..@-1$5)::@33$6=vmean(@2$6..@-1$6)::@33$7=vmean(@2$7..@-1$7)

*** Labels
- HRF: High Risk Findings
- nSLOC: Source lines of code number


** Findings

- Contract implementation-specific bugs are more difficult to be found.
- Number of auditors who finds the same bug mean is about 5.34, with a range from 1 to 39. Most values are between 2 and 7.
- What type of vulnerability is most difficult to be found by auditors?
  + Common Patterns: The 'Derivatives' and 'Yield' categories seem to have a mix of vulnerabilities, with Erroneous state updates (C03) and Wrong Math (C06) being quite common. This could suggest that these types of protocols are susceptible to a variety of vulnerabilities.
  + Outliers: Broken business logic (C07) seems to be more frequent in 'Yield Aggregator' compared to other categories. Privilege escalation and access control issues (C05) is highly prevalent in 'Decentralized Stablecoin', making it an outlier.
  + Dominant Classes: Erroneous state updates (C03) and Wrong Math (C06) appear to be dominant across multiple categories, suggesting these vulnerabilities are common in general.
  + Sparse Classes: Classes like Lack of signature replay protection (C09), Missing check (C10), and Contract implementation-specific bugs (C08) appear less frequently, indicating that they might be specific to certain protocol types or harder to find.
  + Frequency Counts: The height of the bars indicates the frequency. For example, Erroneous state updates (C03) has a high frequency in the 'Derivatives' category, indicating it's a common issue there.
- What category of protocol tends to have the most bugs?
  + 55 bugs were found in Dexes protocols
  + Derivatives category had 25 bugs classified
- Which classification was more present?
  + 36 bugs were classified as Wrong Math (C06)
  + 30 bugs were classified as Broken business logic (C07)
  + 19 bugs were classified as Erroneous state updates (C03)
  + 11 bugs were classified as Missing Check (C10)
- What is the relationship between categories of bugs and different types of protocols?
